package main

import "fmt"

var (
	dict = map[string]string{
		"赵": "0",
		"钱": "1",
		"孙": "2",
		"李": "3",
		"周": "4",
		"吴": "5",
		"郑": "6",
		"王": "7",
		"冯": "8",
		"陈": "9",
		"褚": "a",
		"卫": "b",
		"蒋": "c",
		"沈": "d",
		"韩": "e",
		"杨": "f",
		"朱": "g",
		"秦": "h",
		"尤": "i",
		"许": "j",
		"何": "k",
		"吕": "l",
		"施": "m",
		"张": "n",
		"孔": "o",
		"曹": "p",
		"严": "q",
		"华": "r",
		"金": "s",
		"魏": "t",
		"陶": "u",
		"姜": "v",
		"戚": "w",
		"谢": "x",
		"邹": "y",
		"喻": "z",
		"福": "A",
		"水": "B",
		"窦": "C",
		"章": "D",
		"云": "E",
		"苏": "F",
		"潘": "G",
		"葛": "H",
		"奚": "I",
		"范": "J",
		"彭": "K",
		"郎": "L",
		"鲁": "M",
		"韦": "N",
		"昌": "O",
		"马": "P",
		"苗": "Q",
		"凤": "R",
		"花": "S",
		"方": "T",
		"俞": "U",
		"任": "V",
		"袁": "W",
		"柳": "X",
		"唐": "Y",
		"罗": "Z",
		"薛": ".",
		"伍": "-",
		"余": "_",
		"米": "+",
		"贝": "=",
		"姚": "/",
		"孟": "?",
		"顾": "#",
		"尹": "%",
		"江": "&",
		"钟": "*",
	}
)

func main() {
	str := []string{
		"冯窦王窦福苏苏周窦章福福钱周苏郑陈赵钱福章窦吴冯周陈水窦周章周苏赵钱钱水郑水吴章",
		"王李吴苏李郑章赵冯云郑云赵冯钱郑吴王章云赵云周章章云冯福赵王冯冯冯窦冯陈陈李郑郑",
		"冯赵福李云章福周钱王冯云窦云钱李章周钱周窦云王钱水冯水窦李李孙孙孙福云赵郑水孙陈",
		"水福王水孙云水王陈水孙水窦冯窦陈窦王赵冯赵钱郑章吴福陈吴吴周李钱章冯孙章钱水窦赵",
		"陈孙王赵云孙福冯郑水周郑苏李王周孙苏李赵苏吴李赵章赵窦周郑章王王钱冯钱窦周福孙钱",
		"福李窦陈吴福窦赵李冯水吴陈吴周水福周冯吴孙赵赵冯周苏陈王周窦赵孙苏章章孙王吴水水",
		"钱郑福李水窦冯水窦钱周章吴郑窦郑福水周水郑孙钱赵窦郑章冯孙王冯陈赵福福郑周苏陈赵",
		"章苏李苏周周水水苏王郑水章李苏赵钱云苏孙吴章福冯周孙云福云李福水赵钱苏孙章吴冯吴",
		"苏福福王钱钱李陈孙冯王福郑李吴孙孙王窦福冯李冯章水赵吴孙孙福云李李王章苏冯李孙钱",
		"福吴钱李周云福陈陈赵郑李冯云冯陈冯苏章水福水赵陈章王水水云赵郑吴李吴水王苏苏陈李",
	}

	for _, s := range str {
		for _, r := range s {
			fmt.Print(dict[string(r)])
		}
		fmt.Println()
	}
}
